---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.LayerElemIsVariable
source: html/3db3ea54-3fff-2cf8-4723-355f2815832d.htm
---
# Autodesk.Revit.DB.ParameterTypeId.LayerElemIsVariable Property

"Is Variable"

## Syntax (C#)
```csharp
public static ForgeTypeId LayerElemIsVariable { get; }
```